In [1]:
import pandas as pd

In [3]:
airport_df = pd.read_csv("datasets/airport/airport.csv")
airport_df.head()

   Year  Month Airport  TotalOperations
0  2009      1     ABE             7273
1  2009      1     ABI             6646
2  2009      1     ABQ            13348
3  2009      1     ABY             2992
4  2009      1     ACK             7331

In [4]:
airport_df[airport_df['Year'] == 2018].head()

       Year  Month Airport  TotalOperations
55458  2018      1     ABE             5285
55459  2018      1     ABI             5461
55460  2018      1     ABQ            11403
55461  2018      1     ABY             2187
55462  2018      1     ACK             3901

In [5]:
airport_df[airport_df['Year'] == 2018].groupby('Month').count()

       Year  Airport  TotalOperations
Month
1       518      518              518
2       518      518              518
3       518      518              518
4       518      518              518
5       518      518              518
6       518      518              518
7       518      518              518
8       518      518              518
9       518      518              518
10      518      518              518
11      519      519              519
12      520      520              520

In [6]:
airport_df[airport_df['Year'] == 2018].groupby('Month').sum()['TotalOperations']

Month
1     3869695
2     3691617
3     4394842
4     4367364
5     4565280
6     4660769
7     4763925
8     4764492
9     4351171
10    4526675
11    4106416
12    3932460
Name: TotalOperations, dtype: int64

In [7]:
airport_df.isnull().sum()

Year               0
Month              0
Airport            0
TotalOperations    0
dtype: int64

In [9]:
AIRPORT_COLS_RENAME = {
    'Airport': 'Origin', 
    'TotalOperations': 'Total Operations',
}

airport_df.rename(columns=AIRPORT_COLS_RENAME, inplace=True)

airport_df.head()

   Year  Month Origin  Total Operations
0  2009      1    ABE              7273
1  2009      1    ABI              6646
2  2009      1    ABQ             13348
3  2009      1    ABY              2992
4  2009      1    ACK              7331